Yova_BackendV1/app/controllers/admins_controller.rb

    def show
        #Admin validation via admin signal send from frontend
        @admin = Admin.find(params[:adminID])
        if @admin
            #Search for client user:
            @client = Client.find(params[:clientID])
            if @client
                #Serve admin client notifications in DESC:
                @notifications = Notification.all.order(date: :desc).where(client_id: @client[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."client_id" = $1 ORDER BY "notifications"."date" DESC  [["client_id", 1]]

    def create
        #Admin validation via admin signal sent from frontend:
        @admin = Admin.find(params[:adminID])
        if @admin
            #Use Strong parameters to only require necessary fields for Notification model:
            notificationParams = params.require(:notification).permit(:date, :title, :description, :client_id, :isRead)

            #Find appropriate user:
            @client = Client.find(notificationParams[:client_id])

            #Client user validations:
            if @client
                @newNotification = Notification.create(notificationParams)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "notifications" ("date", "title", "description", "client_id", "isRead", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"