Yova_BackendV1/app/controllers/clients_controller.rb

    def update
        #Find user via frontend directory structure:
        @client = Client.find(params[:clientID])
        #Find relevant notification for user:
        if @client
            @notification = Notification.find(params[:notificationID])
            #Update database with new read status for selected notification:
            notificationParams = params.require(:notification).permit(:isRead)
            notificationParams[:isRead] = true
            @notification.update(notificationParams)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "notifications" SET "isRead" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["isRead", "t"], ["updated_at", "2020-07-08 21:01:42.967737"], ["id", 1]]

    def show
        #Query client user in database:
        @client = Client.find(params[:clientID])

        if @client
            #Query associated client user notifications and return if found:
            clientID = @client[:id]
            @notifications = Notification.where(client_id: clientID)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."client_id" = $1  [["client_id", 1]]